<?php
namespace Controllers;
use Views;
use Models;

class ErrorController {
	protected function view_error () {
		$view = new Views\View();
		$view->view_error();
	}

	public function get_error_check () {
		if (isset($_SESSION['error']['n'])) {
			$this->view_error();
		} else {
			header('Location: /index.php');
		}
	}

	public static function get_error ($n = 0) {
		$error_desc = array(
			0 => 'Unknown error',
			1 => 'Дані по цьому користувачу не знайдені',
			2 => 'Невірний логін або пароль',
			3 => 'Введені паролі не співпадають',
			4 => 'Невірний ПІН',
			5 => 'Помилка під час реєстрації',
			6 => 'Помилка під час відновлення паролю',
			7 => 'Введені паролі не співпадають',
			8 => 'Помилка під час оновлення даних',
			9 => 'Помилка заповнення карти користувача, зверніться до Адміністратора',
			10 => 'Проблеми з видаленням облікового запису',
			11 => 'Ця електрона адреса вже зареєстрована в системі, спробуйте відновити пароль',
			12 => 'Ця електрона адреса ще не зареєстрована в системі, спробуйте зареєструватись',
			13 => 'Увійдіть для створення допису',
			14 => 'Помилка під час створення допису',
			15 => 'Категорія не обрана',
			16 => 'Допис не обрано',
			17 => 'Допис не знайдено',
			18 => 'Помилка видалення допису',
			19 => 'Допис не обрано',
			20 => 'Допис не знайдено',
			21 => 'Увійдіть для зміни допису',
			22 => 'Помилка під час оновлення даних',
			23 => 'Помилка видалення коментарю',
			24 => 'Коментар не обрано',
			25 => 'Коментар не знайдено',
			26 => 'Увійдіть для зміни коментаря',
			27 => 'Помилка під час оновлення даних',
			28 => 'Помилка під час реєстрації коментарю',
			29 => 'Недостатньо прав для перегляду',
			30 => 'Помилка отримання даних користувачів',
			31 => 'Проблеми з видаленням облікового запису',
			32 => 'Помилка під час оновлення даних',
			33 => 'Недостатньо прав для перегляду',
			34 => 'Помилка отримання списку категорій',
			35 => 'Проблеми з видаленням категорії',
			36 => 'Помилка під час оновлення даних',
			37 => 'Помилка під час створення категорії',
		);
		session_start();
		$_SESSION['error']['n'] = $n;
		$_SESSION['error']['desc'] = $error_desc[$n];
		header('Location: /error.php');
	}
}